// Задача 10: Напишите программу, которая принимает 
// на вход трёхзначное число и на выходе показывает 
// вторую цифру этого числа.

// Console.WriteLine("Введите трехзначное число ");
// int num = Convert.ToInt32(Console.ReadLine());
// int num1 = num / 10;
// int num2 = num1 % 10;
// Console.WriteLine(num2);



// Задача 13: Напишите программу, которая выводит третью 
// цифру заданного числа или сообщает, что третьей цифры нет.

// Console.WriteLine("Введите любое число");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num / 100 == 0)
// {
//     Console.WriteLine("Третьей цифры нет");
// }
// else
// {
//     while (num > 1000)
//     {
//         num = num / 10;
//     }
//     Console.WriteLine(num % 10);
// }





// Задача 15: Напишите программу, которая принимает 
// на вход цифру, обозначающую день недели, и проверяет, 
// является ли этот день выходным.

// Console.WriteLine("Введите цифру от 1 до 7");
// int num = Convert.ToInt32(Console.ReadLine());
// if ((num == 6) || (num == 7))
// {
//     Console.WriteLine("Выходной");
// }
// else
// {
//     Console.WriteLine("Рабочий день");
// }